InformationRegisters/ЗамороженнаяЗарплатаПродавцов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЗамороженнаяЗарплатаПродавцов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Заморожена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗарплатаПродавцов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЗарплатаПродавцов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Выручка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Зарплата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Бонус</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗарплатаСНДФЛ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БонусСНДФЛ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбщаяПремияПромо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоСменПромо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбщееКоличествоСменПромо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПланПромо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентОтВыручкиСНДФЛ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КлассТТ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассПродавца</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПродавцов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПродавцовПЧ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентБонуса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>8</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассТТРасчетный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тренинг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Тренинги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДатаНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипРабот</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРаботДляРасчетаЗП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыРаботДляРасчетаЗП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыРаботДляРасчетаЗП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПолныйДень</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолСтавки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Стажер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Практикант</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Открытие_ТТ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПромоТовар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПромоМесяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КупоныВВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СертификатВВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодарочнаяКарта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Наставничество</Name>
					<Comment>Сумма которую получает продавец, если в одну смену с ним выходил стажер</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриведиДруга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Анкета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Промоутер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БонусОтСтажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПремияЗаВыкладку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПремияЗаТайника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удержание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Внештатник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОпросПоСкайпу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФотоОтчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПремияЗаМесяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолнаяНочь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кассир</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тренинг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтаршийПродавецКонсультант</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолныйДеньУР</Name>
					<Comment>Полный день (Управление развитием)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолСтавкиУР</Name>
					<Comment>Пол ставки (Управление развитием)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрактикантУР</Name>
					<Comment>Практикант (Управление развитием)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Открытие_ТТ_Кассир</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КассирУР</Name>
					<Comment>Кассир (Управление развитием)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Грузчик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БонусПомощникаУправляющегоВкусвилл</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммаЗаПереработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭкстренныйВызов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БонусТехнолога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыходЗаЧас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоплатаПраздник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоплатаПереработка_9_10</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоплатаПереработка_11</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоплатаЗаНочнуюСмену</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоплатаЗаРаботуВРазвитии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БонусОтВыручки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоплатаЗаРаботуВРазвитии_2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоплатаЗаРаботуНаТТ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заморозка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пекарь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Открытие_ТТ_Промоутер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоплатаВахтовыйМетод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоплатаЗаРаботуВРознице</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаМинЗП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоплатаПланПродаж</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/ЗамороженнаяЗарплатаПродавцов/Forms/ФормаЗаморозкаРазморозка/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ФизЛицоПриИзменении(Элемент)
	
	ОбновитьСреднююСтавкуЗаПредыдущийМесяц();
	
	ЗаполнитьИнтервалыЗаморозки();	
	
КонецПроцедуры

&НаКлиенте
Процедура РежимПриИзменении(Элемент)
	
	ОбновитьСреднююСтавкуЗаПредыдущийМесяц();
	
	ЗаполнитьИнтервалыЗаморозки();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаСПриИзменении(Элемент)
	
	ОбновитьСреднююСтавкуЗаПредыдущийМесяц();
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура Разморозить(Команда)
	
	ОчиститьСообщения();
	
	ОшибкаЗаполненияПериода = Ложь;
	Если ПериодС > ПериодПо Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не корректно заполнен период разморозки.");
		ОшибкаЗаполненияПериода = Истина;
		
	КонецЕсли;
	
	Если Не ПроверитьЗаполнение() ИЛИ ОшибкаЗаполненияПериода Тогда
		Возврат;	
	КонецЕсли; 
	
	НачалоПериода = ПериодС;
	КонецПериода  = ПериодПо;
	
	ЗаморозитьРазморозитьНаСервере(НачалоПериода, КонецПериода);	
	
КонецПроцедуры

&НаКлиенте
Процедура Заморозить(Команда)
	
	ОчиститьСообщения();
	
	ОшибкаЗаполненияСуммы = Ложь;
	Если Сумма = 0 Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена ставка для заморозки.");
		ОшибкаЗаполненияСуммы = Истина;
		
	КонецЕсли;
	
	ОшибкаЗаполненияПериода = Ложь;
	Если ПериодС > ПериодПо Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не корректно заполнен период заморозки.");
		ОшибкаЗаполненияПериода = Истина;
		
	КонецЕсли;
	
	Если Не ПроверитьЗаполнение() ИЛИ ОшибкаЗаполненияСуммы ИЛИ ОшибкаЗаполненияПериода Тогда
		Возврат;	
	КонецЕсли;
	
	НачалоПериода = ПериодС;
	КонецПериода  = ПериодПо;
	
	ЗаморозитьРазморозитьНаСервере(НачалоПериода, КонецПериода);
	
КонецПроцедуры

&НаСервере
Процедура ЗаморозитьРазморозитьНаСервере(НачалоПериода, КонецПериода)
	
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	
	Пока НачалоПериода <= КонецПериода Цикл
		
		МЗ = РегистрыСведений.ЗамороженнаяЗарплатаПродавцов.СоздатьМенеджерЗаписи();
		
		МЗ.ФизЛицо 			= ФизЛицо;
		МЗ.ПериодДействия 	= НачалоПериода;
		МЗ.Ответственный 	= Ответственный;
		
		Если Режим = 0 Тогда
			
			МЗ.Сумма		= Сумма;
			МЗ.Заморожена 	= Истина;
			
		Иначе
			
			МЗ.Заморожена 	= Ложь;
			
		КонецЕсли; 
		
		МЗ.Записать();
		
		НачалоПериода = НачалоПериода + 86400;
		
	КонецЦикла;
	
	ЗаполнитьИнтервалыЗаморозки();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИнтервалыЗаморозки()
	
	ИнтервалыЗаморозки.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗамороженнаяЗарплатаПродавцов.ПериодДействия КАК ПериодДействия,
	|	ЗамороженнаяЗарплатаПродавцов.Сумма
	|ИЗ
	|	РегистрСведений.ЗамороженнаяЗарплатаПродавцов КАК ЗамороженнаяЗарплатаПродавцов
	|ГДЕ
	|	ЗамороженнаяЗарплатаПродавцов.ФизЛицо = &ФизЛицо
	|	И ЗамороженнаяЗарплатаПродавцов.Заморожена
	|	И ЗамороженнаяЗарплатаПродавцов.ПериодДействия МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПериодДействия";
	
	Запрос.УстановитьПараметр("ФизЛицо"		 , ФизЛицо);
	Запрос.УстановитьПараметр("НачалоПериода", ДобавитьМесяц(ТекущаяДата(), -12));
	Запрос.УстановитьПараметр("КонецПериода" , ДобавитьМесяц(ТекущаяДата(), 12));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НачалоПериодаЗаморозки = Дата(1,1,1);
	ПредыдущийДень = Дата(1,1,1);
	ПредыдущаяСтавка = 0;
	
	Пока Выборка.Следующий() Цикл
		
		Если НачалоПериодаЗаморозки = Дата(1,1,1) Тогда
			
			НачалоПериодаЗаморозки = Выборка.ПериодДействия;
			ПредыдущийДень = Выборка.ПериодДействия;
			ПредыдущаяСтавка = Выборка.Сумма;
			
			Продолжить;
			
		КонецЕсли; 
		
		ТекущийДень = Выборка.ПериодДействия;
		ТекущаяСтавка = Выборка.Сумма;
		
		Если ТекущийДень - 86400 = ПредыдущийДень 
			И ТекущаяСтавка = ПредыдущаяСтавка Тогда
			
			ПредыдущийДень = ТекущийДень;
			ПредыдущаяСтавка = ТекущаяСтавка;
			
			Продолжить;
			
		КонецЕсли; 
		
		НоваяСтрока = ИнтервалыЗаморозки.Добавить();
		НоваяСтрока.ЗамороженоС = НачалоПериодаЗаморозки;
		НоваяСтрока.ЗамороженоПо = ПредыдущийДень;
		НоваяСтрока.Ставка = ПредыдущаяСтавка;
		
		НачалоПериодаЗаморозки = ТекущийДень;
		ПредыдущийДень = ТекущийДень;
		ПредыдущаяСтавка = ТекущаяСтавка;
		
	КонецЦикла; 
	
	Если ЗначениеЗаполнено(НачалоПериодаЗаморозки) Тогда
		
		НоваяСтрока = ИнтервалыЗаморозки.Добавить();
		НоваяСтрока.ЗамороженоС  = НачалоПериодаЗаморозки;
		НоваяСтрока.ЗамороженоПо = ПредыдущийДень;
		НоваяСтрока.Ставка = ПредыдущаяСтавка;
		
	КонецЕсли; 
	
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура УправлениеФормой()
	
	Элементы.ДекорацияИнформацияПоСтавкам.Видимость = (ИнтервалыЗаморозки.Количество() > 0);
	Элементы.ДекорацияНетЗаморозки.Видимость = (ИнтервалыЗаморозки.Количество() = 0) И ЗначениеЗаполнено(ФизЛицо);
	Элементы.ДекорацияСредняяСтавка.Видимость = (Режим = 0) И ЗначениеЗаполнено(ПериодС) И ЗначениеЗаполнено(ФизЛицо);
	
	Элементы.КнопкаЗаморозить.Видимость = (Режим = 0);
	Элементы.Сумма.Видимость = (Режим = 0);
	Элементы.КнопкаРазморозить.Видимость = (Режим = 1);
	
	Если ИнтервалыЗаморозки.Количество() Тогда
		
		ТекстЗаголовка = "Информация  по замороженным ставкам:";
		
		Для каждого Стр Из ИнтервалыЗаморозки Цикл
			ТекстЗаголовка = ТекстЗаголовка + Символы.ПС + "	- с " + Формат(Стр.ЗамороженоС, "ДЛФ=D") + " по " + Формат(Стр.ЗамороженоПо, "ДЛФ=D") + ", ставка: " + Строка(Стр.Ставка);	
		КонецЦикла; 
		
		Элементы.ДекорацияИнформацияПоСтавкам.Заголовок = ТекстЗаголовка;
		
	КонецЕсли; 
	
	Если (Режим = 0) И ЗначениеЗаполнено(ПериодС) И ЗначениеЗаполнено(ФизЛицо) Тогда
		
		Элементы.ДекорацияСредняяСтавка.Заголовок = "Средняя ставка в день за период с " + Формат(ДобавитьМесяц(ПериодС - 86400, -1), "ДЛФ=D") + " по " + Формат(ПериодС - 86400, "ДЛФ=D") + ", составляет: " + Строка(СредняяСтавка);	
		
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСредняяСтавкаНажатие(Элемент)
	
	// Расшифровка
	ДанныеДляРасшифровки = ПолучитьДанныеДляРасшифровкиЗаПредыдущийМесяц();
	
	ТабДокумент = Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакетРасшифровки();
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Продавец = ФизЛицо;
	ТабДокумент.Вывести(ОбластьМакета);
	
	Для каждого Стр Из ДанныеДляРасшифровки Цикл
		
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		ОбластьМакета.Параметры.Заполнить(Стр);
		ТабДокумент.Вывести(ОбластьМакета);
		
	КонецЦикла; 
	
	ТабДокумент.Показать();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСреднююСтавкуЗаПредыдущийМесяц()
	
	Если Режим = 1 Тогда
		
		СредняяСтавка = 0;
		Возврат;
		
	КонецЕсли; 
	
	Если Не (ЗначениеЗаполнено(ПериодС) И ЗначениеЗаполнено(ФизЛицо)) Тогда
		
		СредняяСтавка = 0;
		Возврат;
		
	КонецЕсли; 
	
	МассивТиповРабот = Новый Массив;
	МассивТиповРабот.Добавить(Перечисления.ТипыРаботДляРасчетаЗП.ПолныйДень);
	МассивТиповРабот.Добавить(Перечисления.ТипыРаботДляРасчетаЗП.ПолныйДеньУР);
	МассивТиповРабот.Добавить(Перечисления.ТипыРаботДляРасчетаЗП.ПолнаяНочь);
	МассивТиповРабот.Добавить(Перечисления.ТипыРаботДляРасчетаЗП.Практикант);
	МассивТиповРабот.Добавить(Перечисления.ТипыРаботДляРасчетаЗП.ПрактикантУР);
	МассивТиповРабот.Добавить(Перечисления.ТипыРаботДляРасчетаЗП.Стажер);
	МассивТиповРабот.Добавить(Перечисления.ТипыРаботДляРасчетаЗП.ПолСтавки);
	МассивТиповРабот.Добавить(Перечисления.ТипыРаботДляРасчетаЗП.ПолСтавкиУР);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗарплатаПродавцов.ФизЛицо,
	|	СРЕДНЕЕ(ЗарплатаПродавцов.Бонус) КАК Ставка
	|ИЗ
	|	РегистрСведений.ЗарплатаПродавцов КАК ЗарплатаПродавцов
	|ГДЕ
	|	ЗарплатаПродавцов.ТипРабот В(&ТипыРабот)
	|	И ЗарплатаПродавцов.ДатаНачисления МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ЗарплатаПродавцов.ФизЛицо = &ФизЛицо
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗарплатаПродавцов.ФизЛицо";
	
	Запрос.УстановитьПараметр("ФизЛицо"		 , ФизЛицо);
	Запрос.УстановитьПараметр("ТипыРабот"	 , МассивТиповРабот);
	Запрос.УстановитьПараметр("ДатаНачала"	 , ДобавитьМесяц(ПериодС - 86400, -1));
	Запрос.УстановитьПараметр("ДатаОкончания", ПериодС - 86400);
	
	СредняяСтавка = Запрос.Выполнить().Выгрузить().Итог("Ставка");
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеДляРасшифровкиЗаПредыдущийМесяц()
	
	МассивТиповРабот = Новый Массив;
	МассивТиповРабот.Добавить(Перечисления.ТипыРаботДляРасчетаЗП.ПолныйДень);
	МассивТиповРабот.Добавить(Перечисления.ТипыРаботДляРасчетаЗП.ПолныйДеньУР);
	МассивТиповРабот.Добавить(Перечисления.ТипыРаботДляРасчетаЗП.ПолнаяНочь);
	МассивТиповРабот.Добавить(Перечисления.ТипыРаботДляРасчетаЗП.Практикант);
	МассивТиповРабот.Добавить(Перечисления.ТипыРаботДляРасчетаЗП.ПрактикантУР);
	МассивТиповРабот.Добавить(Перечисления.ТипыРаботДляРасчетаЗП.Стажер);
	МассивТиповРабот.Добавить(Перечисления.ТипыРаботДляРасчетаЗП.ПолСтавки);
	МассивТиповРабот.Добавить(Перечисления.ТипыРаботДляРасчетаЗП.ПолСтавкиУР);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗарплатаПродавцов.ДатаНачисления КАК Дата,
	|	ЗарплатаПродавцов.ТорговаяТочка КАК ТТ,
	|	ЗарплатаПродавцов.Бонус КАК Бонус,
	|	ЗарплатаПродавцов.БонусСНДФЛ
	|ИЗ
	|	РегистрСведений.ЗарплатаПродавцов КАК ЗарплатаПродавцов
	|ГДЕ
	|	ЗарплатаПродавцов.ТипРабот В(&ТипыРабот)
	|	И ЗарплатаПродавцов.ДатаНачисления МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ЗарплатаПродавцов.ФизЛицо = &ФизЛицо";
	
	Запрос.УстановитьПараметр("ФизЛицо"		 , ФизЛицо);
	Запрос.УстановитьПараметр("ТипыРабот"	 , МассивТиповРабот);
	Запрос.УстановитьПараметр("ДатаНачала"	 , ДобавитьМесяц(ПериодС - 86400, -1));
	Запрос.УстановитьПараметр("ДатаОкончания", ПериодС - 86400);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Функция ПолучитьМакетРасшифровки()
	
	Возврат Отчеты.ОтчетПоЗаработнойПлатеПродавцов.ПолучитьМакет("РасшифровкаДляСреднейСтавки");
	
КонецФункции
